{
  "users": [
    {
      "id": 1,
      "email": "a@gmail.com",
      "password": "1q2w3e4r",
      "name": "Teepakon",
      "accnumber": "1622348830",
      "address": "123/456 Bangkok Thailand",
      "gender": "Male"
    }
  ],
  "product": [
    {
      "id": 1,
      "namep": "Tyrannosauras",
      "detailp": "เป็นสัตว์กินเนื้อ เดินสองขา มีกะโหลกศีรษะที่ใหญ่ และเพื่อสร้างความสมดุลมันจึงมีหางที่มีน้ำหนักมาก มีขาหลังที่ใหญ่และทรงพลัง แต่กลับมีขาหน้าขนาดเล็ก มีสองกรงเล็บ ถึงแม้ว่าจะมีไดโนเสาร์กินเนื้อชนิดอื่นที่มีขนาดใหญ่กว่าไทแรนโนซอรัส เรกซ์ แต่มันก็มีขนาดใหญ่ที่สุดในไดโนเสาร์วงศ์เดียวกันและเป็นหนึ่งในผู้ล่าที่มีขนาดใหญ่ที่สุดบนพื้นพิภพ วัดความยาวได้ 12-13 ม. สูง 4.6 ม. จากพื้นถึงสะโพก และมีน้ำหนักถึง 9-18 ตัน ในยุคสมัยของไทแรนโนซอรัส เรกซ์ที่ยังมีนักล่าขนาดใหญ่ชนิดอื่น ๆ นั้น ไทแรนโนซอรัส เรกซ์นั้นเป็นนักล่าที่อยู่บนสุดของห่วงโซ่อาหารในทวีปอเมริกาเหนือ เหยื่อของมันเช่น แฮโดรซอร์, เซอราทอปเซีย หรือ ซอโรพอด เป็นต้น ถึงแม้ว่าผู้เชี่ยวชาญบางคนเชื่อว่าโดยพื้นฐานแล้วไทแรนโนซอรัส เรกซ์เป็นสัตว์กินซาก การถกเถียงในกรณีของไทแรนโนซอรัสว่าเป็นนักล่าหรือสัตว์กินซากนั้นมีมานานมากแล้วในหมู่การโต้แย้งทางบรรพชีวินวิทยา ปัจจุบัน ทีเร็กซ์นั้นสามารถ ล่าเหยื่อตัวเดียว ล่าเป็นฝูงทั้งครอบครัว และกินซาก แน่นอนรวมถึงไดโนเสาร์นักล่าทุกชนิด ที่ล้วนแล้วก็มีโอกาสเป็นนักกินซากได้ทั้งหมด",
      "pricep": "111111",
      "photo": "https://jurassicdna.com/wp-content/uploads/2022/07/Jurassic_Park_Tyrannosaurus_Rex.png",
      "count": "1"
    },
    {
      "id": 2,
      "namep": "Camptosaurus",
      "detailp": "มีชีวิตอยู่ในช่วงปลายยุคจูแรสสิค ทางตะวันตกของทวีปอเมริกาเหนือ ชื่อหมาย ชื่อนี้มาจากโครงสร้างของมันที่สามารถยืนตรง 2 เท้าหรือ 4 เท้าก็ได้ ขนาดตัวไม่ใหญ่มากนัก ความยาวประมาณ 6.5 เมตร และ ส่วนสูง 2 เมตรจากพื้นถึงเอว และประมาณน้ำหนัก 785-874 กิโลกรัม เป็นไดโนเสาร์ในกลุ่มสะโพกนก (Ornithischia) รุ่นแรกๆของกลุ่มสายพันธุ์ที่ต่อไปในสมัยหลังจะวิวัฒนาการไปเป็น อิกัวโนดอน และ ไดโนเสาร์ตระกูลปากเป็ดในยุคครีเทเชียส มันมีปากตัด เพื่อเอาไว้สำหรับกินพืชในป่าเป็นไดโนเสาร์ที่ไม่ได้มีขนาดอาวุธป้องกันตัวครบเครื่องแบบสเตโกซอรัส หรือ มีขนาดใหญ่ร่างยักษ์อย่างซอโรพอด ฝีเท้าก็ไม่ว่องไวนักเนื่องจากน้ำหนักตัวที่หนักไป (จนต้องยืน 4 ขา ในบางเวลา) จึงมักกลายถูกล่าเป็นเหยื่อจากพวกไดโนเสาร์กินเนื้อในป่า จนกระทั่งมันเริ่มวิวัฒนาการไปเป็น ไดโนเสาร์ร่างใหญ่ติดอาวุธอย่างอิกัวโนดอน",
      "pricep": "222222",
      "photo": "https://t4.ftcdn.net/jpg/00/73/12/77/360_F_73127765_us6K2KTSw18XmDC9XdDnIyZLvitjZiPK.jpg",
      "count": "1"
    },
    {
      "id": 3,
      "namep": "Carcharodontosaurus",
      "detailp": " เป็นหนึ่งในไดโนเสาร์เทอโรพอดกินเนื้อที่มีขนาดใหญ่ที่สุดชนิดหนึ่ง มีชีวิตอยู่ในช่วงซีโนมาเนียนของยุคครีเทเชียสเมือประมาณ 98-95 ล้านปีก่อน มีขนาดโดยประมาณ 12—13.7 เมตร มีน้ำหนักประมาณ 6.2−15.1 ตัน ความยาวกระโหลก 1.42-1.63 เมตร คาร์คาโรดอนโทซอรัสจัดอยู่ในกลุ่มไดโนเสาร์เทอโรพอดวงศ์ Carcharodontosauridae และเป็นไดโนเสาร์เทอโรพอดทีใหญ่ที่สุดในวงศ์เดียวกัน Carcharodontosaurid ที่มีความใกล้ชิดกับ Giganotosaurus",
      "pricep": "333333",
      "photo": "https://images.squarespace-cdn.com/content/v1/5dfccafa7cc66265b6f96e1c/1582293718261-6C5YEB5GPLTVQ63816T2/%E9%B2%A8%E9%BD%BF%E9%BE%99.png",
      "count": "1"
    },
    {
      "id": 4,
      "namep": "Phuwiangosaurus",
      "detailp": "เป็นชื่อสกุลของไดโนเสาร์ที่พบในภาคตะวันออกเฉียงเหนือของประเทศไทย ในหมวดหินเสาขัว อายุราวยุคครีเตเชียสตอนต้น ประมาณ 130 ล้านปีมาแล้ว เป็นไดโนเสาร์ซอโรพอด (sauropod - ไดโนเสาร์กินพืชคอยาว) ชนิดแรกที่บรรยายลักษณะจากประเทศไทย จัดอยู่ในกลุ่ม Titanosaur ซึ่งเป็นซอโรพอดขนาดกลาง ความยาวประมาณ 15-20 เมตร โดยตัวอย่างต้นแบบ (type specimens) พบที่ภูเวียง อำเภอภูเวียง (อำเภอเวียงเก่า ในปัจจุบัน) จังหวัดขอนแก่นเมื่อปี พ.ศ. 2525 และได้รับการบรรยายลักษณะเมื่อปี พ.ศ. 2537 (ค.ศ. 1994)พบกระดูกภูเวียงโกซอรัส สิรินธรเน จากหลายแหล่งในภาคตะวันออกเฉียงเหนือ โดยเฉพาะแหล่ง วัดสักกะวัน ภูกุ้มข้าว อำเภอสหัสขันธ์ จังหวัดกาฬสินธุ์ (ปัจจุบันเป็นที่ตั้งของพิพิธภัณฑ์สิรินธร ศูนย์ศึกษาวิจัยและพิพิธภัณฑ์ไดโนเสาร์ภูกุ้มข้าว) ซึ่งพบโครงกระดูกอย่างน้อย 6 ตัว จำนวนมากกว่า 800 ชิ้น และแหล่งภูเวียง อำเภอเวียงเก่า จังหวัดขอนแก่น สถานที่พบเป็นครั้งแรก (type locality) พบกระดูกของพวกวัยเยาว์ ขนาดประมาณ 2 เมตร สูง 0.5 เมตรรวมอยู่ด้วย",
      "pricep": "444444",
      "photo": "https://images.fineartamerica.com/images-medium-large-5/sauroposeidon-dinosaur-nobumichi-tamura.jpg",
      "count": "1"
    },
    {
      "id": 5,
      "namep": "Megaraptor",
      "detailp": " ฟอสซิลของมันค้นพบครั้งแรกที่อาร์เจนตินา โดยนายโนวาส เมื่อปีค.ศ.1998 มีชื่อเต็มว่า เมก้าแร็ปเตอร์ นามันฮัวอิคิวอิ (Megaraptor namunhuaiquii) ซึ่งมีความหมายว่าหัวขโมยขนาดยักษ์ อาศัยอยู่ในยุคครีเทเชียสตอนปลาย เมื่อประมาณ 98 ล้านปีก่อน เป็นไดโนเสาร์กินเนื้อขนาดใหญ่ประมาณรถเมล์ มีความยาวระหว่าง 6-8 เมตร สูงจากพื้นถึงหัว 4 เมตร แต่ก็เคยพบขนาดใหญ่ที่สุดยาว 9 เมตร มีเล็บที่มือยาวถึง 15 นิ้ว ซึ่งอาจจะยาวที่สุดในไดโนเสาร์ทั้งหมด คาดว่ามีไว้ล่าเหยื่อขนาดใหญ่อย่างอมาร์กาซอรัส หรืออาร์เจนติโนซอรัส ในช่วงแรกมันถูกจัดอยู่ในพวกแร็พเตอร์โดรเมโอซอร์ เนื่องจากค้นพบฟอสซิลเพียงชิ้นเดียวคือกรงเล็บรูปร่างโค้งคล้ายเคียวขนาดใหญ่ของมัน แต่ทว่าเรื่องจริงก็ถูกเปิดเผย จากการค้นพบฟอสซิลเพิ่มเติม นักบรรพชีวินพบว่าแท้จริงแล้วกรงเล็บนั้นไม่ได้อยู่บนนิ้วเท้าแบบของพวกโดรมีโอซอร์ แต่กลับอยู่บนมือ ทำให้เมก้าแรพเตอร์เปลี่ยนสถานะไปในทันที ปัจจุบัน เมก้าแรพเตอร์มีวงศ์ย่อยเป็นของมันเองคือ Megaraptora ซึ่งจะประกอบไปด้วยเทอโรพอดแปลกประหลาดอีกหลายตัว เช่น อีโอไทแรนนัส ออสตราโลเวเนเทอร์ ฯ ส่วนวงศ์ใหญ่ที่คลุม Megaraptora อีกทีนั้นยังไม่แน่ชัด บ้างก็ว่าเป็น Tyrannosauroid บ้างก็ว่าเป็น Allosauroid หรือ Spinosauroid ",
      "pricep": "555555",
      "photo": "https://preview.redd.it/44123t3eiup11.png?auto=webp&s=30f98e989adfc9f5995e60ed112acaa915ae68d4",
      "count": "1"
    },
    {
      "id": 6,
      "namep": "Saltasaurus",
      "detailp": "เป็นไดโนเสาร์ตระกูลซอโรพอดในกลุ่มไททันโนซอร์ ขนาดเล็กที่เหลืออยู่ถึงปลายยุคครีเตเซียส 75 - 65 ล้านปีในอเมริกาใต้ และ เป็นสายพันธุ์ที่มีขนาดเล็กลงมาอีก คือมีความยาวเพียง 12 เมตร หนัก 7 ตัน แต่ก็นับว่าใหญ่โตสำหรับสัตว์ในปัจจุบันซัลตาซอรัสมีช่วงคอ กับ ส่วนหางที่สั้นเมื่อเทียบกับชนิดและมีช่วงขาที่สั้นม่อต้อ แต่ลักษณะเด่นของมัน คือ มันเป็นซอโรพอดชนิดแรกที่พบว่า มีปุ่มกระดูกเกล็ดผุดขึ้นมาจากผิวหนัง เพื่อประโยชน์เป็นเกราะ ป้องกันลำตัวมันจากนักล่า คล้ายๆกับ ไดโนเสาร์หุ้มเกราะ เรียกว่า Osteoderm ซึ่งสามารถพบปุ่มเช่นเดียวกันนี้กับไททันโนซอร์ชนิดอื่นบ้าง",
      "pricep": "666666",
      "photo": "https://dinosaurtime.e2ecdn.uk/products/2301230_Diplodocus_1.jpg?quality=85",
      "count": "1"
    },
    {
      "id": 7,
      "namep": "Ceratosaurus",
      "detailp": " เป็นไดโนเสาร์กินเนื้อ (เทอโรพอด) อยู่ในช่วง (Kimmeridgian กับ Tithonian) ของช่วงปลายยุคจูแรสสิค มีความใกล้ชิดกับNoasauridaeและAbelisauridaeแต่ขนาดตัวใหญ่และเล็กกว่าครึ่งหนึ่ง ความยาวลำตัวประมาณ 6 เมตร แต่จากการคำนวณคาดว่า ตัวโตที่สุดอาจยาวได้ 8.8 เมตร มีลักษณะ คล้ายอัลโลซอรัส แต่มีส่วนหัวที่โตกว่าเมื่อเทียบกับสัดส่วนลำตัว แขนสั้นและเล็กมี 4 นิ้วไม่น่าใช้เป็นอาวุธได้ และมีเขายื่นออกมาจากเหนือจมูกและดวงตา เป็นเอกลักษณ์และที่มาของชื่อ กิ้งก่ามีเขาของมัน แต่เขาของเซราโตซอรัส เป็นแผ่นกระดูกบางๆ ไม่แข็งแกร่งพอจะเอาไปใช้เป็นอาวุธได้ จึงมีการตั้งข้อสังเกตว่า เขาของมันน่าจะมีไว้เพื่อดึงดูดตัวเมียฟันของของ(เซราโตซอรัส)ยาวมากเมื่อเทียบกับขนาดลำตัว แต่แบนและบางกว่า นักล่ายุคเดียวกัน เหมาะกับการตัดเนื้อกิน แต่ไม่สามารถบดกระดูกได้ ทำให้คาดได้ว่า เหยื่อของมันน่าจะเป็นไดโนเสาร์กินพืชขนาดกลาง ที่ฉีกเนื้อกินได้ง่ายกว่า ปัจจุบันพบรอยกัดของ เซราโตซอรัส หรือ อาจจะเป็น ทอร์วอซอรัส ที่บริเวณขาของ อัลโลซอรัสบวกกับการศึกษาที่พบฟอสซิล เชื่อว่า เซราโตซอรัสมักจะล่าเหยื่อในป่าทึบ ตามลำพังคล้ายๆกับ เสือดาว จึงมีคนเรียกมันว่าเสือดาวแห่งโลกล้านปี แม้จะมีขนาดตัวเล็กกว่านักล่าอื่นๆ แต่ก็มีร่างกายแข็งแกร่ง และ ปราดเปรียว จัดได้ว่าเป็นนักล่าตัวยงอีกสายพันธุ์หนึ่ง",
      "pricep": "777777",
      "photo": "https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/1dbc1935-6542-4ee3-822f-135cff4ba62c/decyh7l-312b6bcb-72f0-4dff-91c7-a27aa82c0e76.png?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzFkYmMxOTM1LTY1NDItNGVlMy04MjJmLTEzNWNmZjRiYTYyY1wvZGVjeWg3bC0zMTJiNmJjYi03MmYwLTRkZmYtOTFjNy1hMjdhYTgyYzBlNzYucG5nIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.S7h9wgNaciZDjdb795PUAzu2qoxe6hNhzcdD_OyXtJo",
      "count": "1"
    },
    {
      "id": 8,
      "namep": "Saurophaganax",
      "detailp": "ชื่อมีความหมายว่านายพรานล่าซอโรพอด เป็นไดโนเสาร์กินเนื้อที่ใหญ่ที่สุดในยุคจูแรสซิก ยาวประมาณ 13 เมตร และหนักประมาณ 3-5 ตัน อยู่ในตระกูลอัลโลซอริดี (allosauridae) มีเขี้ยวแบบใบเลื่อยไว้สำหรับตัดชิ้นเนื้อออกจากเหยื่ออย่างซอโรพอดตามความหมายของชื่อของมัน ค้นพบในรัฐโอคลาโฮมา ส่วนกระดูกขาอ่อนกระดูกสันหลังหลายหางและกระดูกสะโพกมีการพบในภาคเหนือของรัฐนิวเม็กซิโก ของประเทศสหรัฐอเมริกา มันถูกพบครั้งแรกเมื่อปี 1995 โดย ดร.คลัช ในครั้งแรกที่ดร.คลัช ค้นพบฟอสซิลยังไม่สมบูรณ์ แต่ในปี 2003 ได้มีการค้นพบฟอสซิลกระดูกเพิ่ม ซึ่งประมาณการความยาวได้ 11-13 เมตร หนักประมาณ 3-5ตัน สูง 4เมตร",
      "pricep": "888888",
      "photo": "https://render.fineartamerica.com/images/rendered/default/print/6/8/break/images-medium/saurophaganax-maximus-a-prehistoric-sergey-krasovskiy.jpg",
      "count": "1"
    }
  ],
  "cart": []
}